In [203]:
import pandas as pd


data = {"Apple": "red", "Banana":"yellow", "Orange":"orange"}

df = pd.DataFrame({"Fruit":['Apple', 'Banana','Orange'],
                   "Color": ['red', 'yellow', 'orange']})

# df = pd.DataFrame(
#     data = data, 
#     columns = ['a', 'b']
#     )

print(df)
df.Fruit = df.Fruit.str.upper()
df.head() #상위 몇개만 찾아보는 용도 



print()
print(type(df))
print(type(df["Fruit"]))
print()



# data_frame = pd.read_csv('data/frien_list.csv')
# data_frame.head()

    Fruit   Color
0   Apple     red
1  Banana  yellow
2  Orange  orange

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

#### 데이터 프레임 생성시, 컬럼의 순서가 뒤바뀔 수 있다. 다시 한 번 설정해주면 설정한 순서대로 설정된다.

In [204]:
import pandas as pd


# data_frame = pd.read_csv('/Users/jinhyeju/Documents/GitHub/pandas/data/friend_list.csv')
# data_frame.head()

data_frame = pd.read_excel('/Users/jinhyeju/Desktop/coding/dataAnalyze/Power BI/06.쿼리 편집/서울 지역/Seoul/서울_07월.xlsx')
data_frame.head()

   판매ID       주문날짜  담당자  지역  대리점  제품코드      단가  수량  할인율       금액
0  1829 2019-07-02  유가을  서울   41    44   39588  79  0.1  2814707
1  1830 2019-07-02  윤대현  서울   14    41  115140  32  0.0  3684480
2  1831 2019-07-03  안정훈  서울   17    34   71988  28  0.0  2015664
3  1832 2019-07-03  강동원  서울   45    50   15588  13  0.0   202644
4  1833 2019-07-04  윤대현  서울   14    39   93216   3  0.0   279648

In [205]:
import os

BASE_DIR = os.getcwd()
print(BASE_DIR)

# file_path = os.path.join(BASE_DIR, '../Power BI/06.쿼리 편집/서울 지역/Seoul/서울_07월.xlsx')
file_path = os.path.dirname('서울_07월.xlsx')
# file_path = os.path.join(BASE_DIR, )
print(file_path)

/Users/jinhyeju/Desktop/coding/dataAnalyze/dataAnalyze_python/Web Crawling

In [206]:
import os

BASE_DIR = os.getcwd()
print(BASE_DIR)

file_path = os.path.join(BASE_DIR, "test" ,"test.csv")
print(file_path)

split_DIR  = file_path.split('/')
print(split_DIR)

/Users/jinhyeju/Desktop/coding/dataAnalyze/dataAnalyze_python/Web Crawling
/Users/jinhyeju/Desktop/coding/dataAnalyze/dataAnalyze_python/Web Crawling/test/test.csv
['', 'Users', 'jinhyeju', 'Desktop', 'coding', 'dataAnalyze', 'dataAnalyze_python', 'Web Crawling', 'test', 'test.csv']

In [207]:
print(split_DIR)
for i in range(0, len(split_DIR)):
    print(i)

['', 'Users', 'jinhyeju', 'Desktop', 'coding', 'dataAnalyze', 'dataAnalyze_python', 'Web Crawling', 'test', 'test.csv']
0
1
2
3
4
5
6
7
8
9

In [208]:
import pandas as pd

s1 = pd.core.series.Series(['one', 'two','three'])
s2 = pd.core.series.Series([1,2,3])

pd.DataFrame(data=dict(word=s1, num=s2)) #랜덤하게 결과값 나옴

    word  num
0    one    1
1    two    2
2  three    3

In [209]:
df = pd.read_csv('/Users/jinhyeju/Documents/GitHub/pandas/data/friend_list_no_head.csv', header = None)

df.head()
df.columns = ['name','age','job']
print(df)

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [210]:
df.to_csv("파일명", sep="구분자")

TypeError: "delimiter" must be a 1-character string

In [ ]:
friend_list = [
    ['name', ['John','Jenny','Nancy'],['Lee','Kim','Jeon']],
    ['age', [20,30,24],[17,19,15]],
    ['job', ['student','developer','teacher'],['grade1','grade2','grade3']],
    ['height', [180,157,168], [155,160,165]]
]

df = pd.DataFrame(friend_list)
df.head()

# df.shape

        0                              1                         2
0    name           [John, Jenny, Nancy]          [Lee, Kim, Jeon]
1     age                   [20, 30, 24]              [17, 19, 15]
2     job  [student, developer, teacher]  [grade1, grade2, grade3]
3  height                [180, 157, 168]           [155, 160, 165]

In [ ]:
# df.iloc[3:][:]
df.iloc[ : , [0,2]]

        0                         2
0    name          [Lee, Kim, Jeon]
1     age              [17, 19, 15]
2     job  [grade1, grade2, grade3]
3  height           [155, 160, 165]

In [ ]:
df.iloc[1][1]

[20, 30, 24]

In [ ]:
df.iloc[3][2]

[155, 160, 165]

In [ ]:
import pandas as pd


data = {"Apple": "red", "Banana":"yellow", "Orange":"orange"}

df = pd.DataFrame({"Fruit":['Apple', 'Banana','Melon','Orange'],
                   "Color": ['red', 'yellow', 'green','orange'],
                   "Price": [2000,3000,5000,4000],
                   "Quantity": [3,4,2,1]})

df.head()

    Fruit   Color  Price  Quantity
0   Apple     red   2000         3
1  Banana  yellow   3000         4
2   Melon   green   5000         2
3  Orange  orange   4000         1

In [ ]:
df.iloc[1][0]

# df.iloc[0,1]

'Banana'

In [ ]:
df_filtered = df[(df.Fruit  == 'Apple') | (df.Color == 'green')]

print(df_filtered)

   Fruit  Color  Price  Quantity
0  Apple    red   2000         3
2  Melon  green   5000         2

In [ ]:
df.filter(items = ['Quantity', 'Fruit'])

   Quantity   Fruit
0         3   Apple
1         4  Banana
2         2   Melon
3         3  Orange

In [ ]:
#select columns containing 'a'
#axis = 0 or 1 
# df.filter(like='M',axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [ ]:
# df.drop(['Fruit','Name'],inplace =True)

# df = df[df.Fruit != 'Apple']
# print(df)
# print()
# df1 = df[df.Quantity > 1]
# print(df1)

# df['discount'] = [0.1,0.2,0.1,0.3]
# print(df)

    Fruit   Color  Price  Quantity  discount
0   Apple     red   2000         3       0.1
1  Banana  yellow   3000         4       0.2
2   Melon   green   5000         2       0.1
3  Orange  orange   4000         1       0.3

In [ ]:
import numpy as np

df['discount'] = np.where(df['Quantity'] > 1, 'yes', 'no')
print(df)

    Fruit   Color  Price  Quantity discount
0   Apple     red   2000         3      yes
1  Banana  yellow   3000         4      yes
2   Melon   green   5000         2      yes
3  Orange  orange   4000         1       no

In [ ]:
df['total_price'] = df['Quantity']*df['Price']

In [ ]:
print(df)

    Fruit   Color  Price  Quantity discount  total_price
0   Apple     red   2000         3      yes         6000
1  Banana  yellow   3000         4      yes        12000
2   Melon   green   5000         2      yes        10000
3  Orange  orange   4000         1       no         4000

In [ ]:
df['avg_price'] = df['total_price'] / 4

In [ ]:
print(df)

    Fruit   Color  Price  Quantity discount  total_price  avg_price
0   Apple     red   2000         3      yes         6000     1500.0
1  Banana  yellow   3000         4      yes        12000     3000.0
2   Melon   green   5000         2      yes        10000     2500.0
3  Orange  orange   4000         1       no         4000     1000.0

In [ ]:
quality = []

for i in df['Quantity']:
    if i < 2:
        quality.append('A')
    elif 2 <= i < 3:
        quality.append('B')
    else:
        quality.append('C')
        
df['quality'] = quality

In [ ]:
print(df)

    Fruit   Color  Price  Quantity discount  total_price  avg_price quality
0   Apple     red   2000         3      yes         6000     1500.0       C
1  Banana  yellow   3000         4      yes        12000     3000.0       C
2   Melon   green   5000         2      yes        10000     2500.0       B
3  Orange  orange   4000         1       no         4000     1000.0       A

In [ ]:
def pass_or_fail(row):
    print(row)
    if row != 'F':
        return 'Pass'
    else:
        return 'Fail'

pass_or_fail(quality)

['C', 'C', 'B', 'A']

'Pass'

In [ ]:
# pass_or_fail = []

# df.quality = df.quality.apply(pass_or_fail)

C
C
B
A

In [ ]:
date_list = [{'yyyy-mm-dd': '2000-06-27'},
         {'yyyy-mm-dd': '2002-09-24'},
         {'yyyy-mm-dd': '2005-12-20'}]
df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [ ]:
def extract_year(row):
    return row.split('-')[0]

In [ ]:
df['year'] = df['yyyy-mm-dd'].apply(extract_year)
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

In [ ]:
def extract_year(year, current_year):
    return current_year - int(year)

df['age'] = df['year'].apply(extract_year, current_year = 2022)
df

   yyyy-mm-dd  year  age
0  2000-06-27  2000   22
1  2002-09-24  2002   20
2  2005-12-20  2005   17

In [231]:
import pandas as pd

student_list = [{'name':'John', 'major': 'Marketing', 'sex':'male'},
                {'name':'Jin', 'major': 'Marketing', 'sex':'female'},
                {'name':'Levant', 'major': 'Business management', 'sex':'male'},
                {'name':'Nah', 'major': 'Art', 'sex':'male'},
                {'name':'Jeon', 'major': 'Social', 'sex':'female'},
                {'name':'Yoon', 'major': 'Marketing', 'sex':'female'},
                {'name':'Joe', 'major': 'Fashion', 'sex':'female'},
                {'name':'Kim', 'major': 'Fashion', 'sex':'male'},
                {'name':'Lee', 'major': 'Business management', 'sex':'female'},
                {'name':'Lee', 'major': 'Marketing', 'sex':'female'},
                {'name':'Jeong', 'major': 'Business management', 'sex':None},
                {'name':'Choi', 'major': None, 'sex':'female'}]


df = pd.DataFrame(student_list, columns = ['name', 'major','sex'])
df
df.head()

     name                major     sex
0    John            Marketing    male
1     Jin            Marketing  female
2  Levant  Business management    male
3     Nah                  Art    male
4    Jeon               Social  female

In [232]:
groupby_major = df.groupby('major')

groupby_major.groups #index값으로 key return

{'Art': [3], 'Business management': [2, 8, 10], 'Fashion': [6, 7], 'Marketing': [0, 1, 5, 9], 'Social': [4]}

In [233]:
for name, group in groupby_major:
    print(name + ": "+str(len(group)))
    print(group)
    print()

Art: 1
  name major   sex
3  Nah   Art  male

Business management: 3
      name                major     sex
2   Levant  Business management    male
8      Lee  Business management  female
10   Jeong  Business management    None

Fashion: 2
  name    major     sex
6  Joe  Fashion  female
7  Kim  Fashion    male

Marketing: 4
   name      major     sex
0  John  Marketing    male
1   Jin  Marketing  female
5  Yoon  Marketing  female
9   Lee  Marketing  female

Social: 1
   name   major     sex
4  Jeon  Social  female

In [234]:
df_major_cnt = pd.DataFrame({'count' : groupby_major.size()})
df_major_cnt

                     count
major
Art                      1
Business management      3
Fashion                  2
Marketing                4
Social                   1

In [235]:
df_major_cnt = pd.DataFrame({'count' : groupby_major.size()}).reset_index()
df_major_cnt

                 major  count
0                  Art      1
1  Business management      3
2              Fashion      2
3            Marketing      4
4               Social      1

In [236]:
groupby_sex = df.groupby('sex')

for name, group in groupby_sex:
    print(name +": "+str(len(group)))
    print(group)
    print()

female: 7
    name                major     sex
1    Jin            Marketing  female
4   Jeon               Social  female
5   Yoon            Marketing  female
6    Joe              Fashion  female
8    Lee  Business management  female
9    Lee            Marketing  female
11  Choi                 None  female

male: 4
     name                major   sex
0    John            Marketing  male
2  Levant  Business management  male
3     Nah                  Art  male
7     Kim              Fashion  male

In [237]:
df_sex_cnt = pd.DataFrame({'count': groupby_sex.size()}).reset_index()
df_sex_cnt

      sex  count
0  female      7
1    male      4

In [238]:
df.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
dtype: bool

In [239]:
df = df.drop_duplicates()

In [240]:
df

      name                major     sex
0     John            Marketing    male
1      Jin            Marketing  female
2   Levant  Business management    male
3      Nah                  Art    male
4     Jeon               Social  female
5     Yoon            Marketing  female
6      Joe              Fashion  female
7      Kim              Fashion    male
8      Lee  Business management  female
9      Lee            Marketing  female
10   Jeong  Business management    None
11    Choi                 None  female

In [241]:
df.duplicated(['name'])

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9      True
10    False
11    False
dtype: bool

In [242]:
df.drop_duplicates(['name'], keep='last')
df

      name                major     sex
0     John            Marketing    male
1      Jin            Marketing  female
2   Levant  Business management    male
3      Nah                  Art    male
4     Jeon               Social  female
5     Yoon            Marketing  female
6      Joe              Fashion  female
7      Kim              Fashion    male
8      Lee  Business management  female
9      Lee            Marketing  female
10   Jeong  Business management    None
11    Choi                 None  female

In [243]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 12 entries, 0 to 11
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    12 non-null     object
 1   major   11 non-null     object
 2   sex     11 non-null     object
dtypes: object(3)
memory usage: 384.0+ bytes

In [244]:
df.isna()

     name  major    sex
0   False  False  False
1   False  False  False
2   False  False  False
3   False  False  False
4   False  False  False
5   False  False  False
6   False  False  False
7   False  False  False
8   False  False  False
9   False  False  False
10  False  False   True
11  False   True  False

In [245]:
df.isnull()

     name  major    sex
0   False  False  False
1   False  False  False
2   False  False  False
3   False  False  False
4   False  False  False
5   False  False  False
6   False  False  False
7   False  False  False
8   False  False  False
9   False  False  False
10  False  False   True
11  False   True  False

In [246]:
# tmp = df
# tmp["sex"] = tmp["sex"].fillna("female")
# tmp
tmp = df
tmp["major"] = tmp["major"].fillna("marketing")
tmp

      name                major     sex
0     John            Marketing    male
1      Jin            Marketing  female
2   Levant  Business management    male
3      Nah                  Art    male
4     Jeon               Social  female
5     Yoon            Marketing  female
6      Joe              Fashion  female
7      Kim              Fashion    male
8      Lee  Business management  female
9      Lee            Marketing  female
10   Jeong  Business management    None
11    Choi            marketing  female

In [247]:
print(df.major.unique())

['Marketing' 'Business management' 'Art' 'Social' 'Fashion' 'marketing']

In [248]:
df.major.value_counts()

Marketing              4
Business management    3
Fashion                2
Art                    1
Social                 1
marketing              1
Name: major, dtype: int64

## 두 개의 데이터프레임 합치기

In [2]:
import pandas as pd

l1 = [{'name': 'John', 'job': "teacher"},
      {'name': 'Nate', 'job': "student"},
      {'name': 'Fred', 'job': "developer"}]

l2 = [{'name': 'Ed', 'job': "dentist"},
      {'name': 'Jack', 'job': "farmer"},
      {'name': 'Ted', 'job': "designer"}]

df1 = pd.DataFrame(l1, columns = ['name', 'job'])
df2 = pd.DataFrame(l2, columns = ['name', 'job'])

#### pd.concat
두번째 데이터프레임을 첫번째 데이터 프레임의 새로운 로우(행)로 합침

In [3]:
frames = [df1,df2]
result = pd.concat(frames, ignore_index = True)

In [4]:
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

### df.append
두번째 데이터프레임을 첫번째 데이터프레임의 새로운 로우(행)로 합침

In [6]:
import pandas as pd

l1 = [{'name': 'John', 'job': "teacher"},
      {'name': 'Nate', 'job': "student"},
      {'name': 'Fred', 'job': "developer"}]

l2 = [{'name': 'Ed', 'job': "dentist"},
      {'name': 'Jack', 'job': "farmer"},
      {'name': 'Ted', 'job': "designer"}]

df1 = pd.DataFrame(l1, columns = ['name', 'job'])
df2 = pd.DataFrame(l2, columns = ['name', 'job'])

appendResult = df1.append(df2, ignore_index = True)

/var/folders/jq/qmxmjhpj395gp3tcswdj37qm0000gn/T/ipykernel_15177/241580185.py:14: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  appendResult = df1.append(df2, ignore_index = True)

In [7]:
appendResult

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

## pd.concat
두번째 데이터프레임을 첫번째 데이터프레임의 새로운 컬럼(열)으로 합침

In [22]:
import pandas as pd
l1 = [{'name': 'John', 'job': "teacher"},
      {'name': 'Nate', 'job': "student"},
      {'name': 'Jack', 'job': "developer"}]

l2 = [{'age': 25, 'country': "U.S"},
      {'age': 30, 'country': "U.K"},
      {'age': 45, 'country': "Korea"}]

df1 = pd.DataFrame(l1, columns = ['name', 'job'])
df2 = pd.DataFrame(l2, columns = ['age', 'country'])

#axis = 1 > 열로 추가
resultColumns = pd.concat([df1, df2], axis = 1, ignore_index = True)

In [26]:
#Change columns name

resultColumns.columns = ['name','job','age','nationality']

# resultColumns = resultColumns(['name', 'job', 'age','natonality'])

In [27]:
resultColumns

   name        job  age nationality
0  John    teacher   25         U.S
1  Nate    student   30         U.K
2  Jack  developer   45       Korea

# 두개의 리스트를 묶어서 데이터프레임으로 생성하기

In [33]:
import pandas as pd
label = [1,2,3,4,5]
prediction = [1,2,2,5,5]

comparison = pd.DataFrame(
    {'label': label,
     'prediction':prediction}
)

In [34]:
comparison

   label  prediction
0      1           1
1      2           2
2      3           2
3      4           5
4      5           5